[["A network administrator enters the command copy running-config startup-config. Which type of memory will the startup configuration be placed into?", ["NVRAM"]], ["Which packet-forwarding method does a router use to make switching decisions when it is using a forwarding information base and an adjacency table?", ["Cisco Express Forwarding"]], ["Fill in the blank.", []], ["What are two functions of a router? (Choose two.)", ["A router connects multiple IP networks", "It determines the best path to send packets"]], ["In order for packets to be sent to a remote destination, what three pieces of information must be configured on a host? (Choose three.)", ["IP address", "subnet mask", "default gateway"]], ["Which software is used for a network administrator to make the initial router configuration securely?", ["terminal emulation client software"]], ["The exhibit consists of a network diagram that shows R1 with three network connections: two Ethernet segments and a WAN link. The WAN link connects R1 to a second router R2. R2 is the DCE on the WAN link. The configuration shown is as follows:", []], ["What is a characteristic of an IPv4 loopback interface on a Cisco IOS router?​", ["It is a logical interface internal to the router"]], ["What two pieces of information are displayed in the output of the show ip interface brief command? (Choose two.)", ["IP addresses", "Layer 1 statuses"]], ["When a router receives a packet, what information must be examined in order for the packet to be forwarded to a remote destination?", ["destination IP address"]], ["Which two items are used by a host device when performing an ANDing operation to determine if a destination address is on the same local network? (Choose two.)", ["destination IP address", "subnet mask"]], ["PC A is connected to switch S1, which in turn is connected to router R1. Router R1 is connected to a cloud, and the cloud is connected to Server B.", []], ["Server B is connected to switch S1, which in turn is connected to router R1. Router R1 is connected to a cloud, and the cloud is connected to PC A.", []], ["Refer to the exhibit. If PC1 is sending a packet to PC2 and routing has been configured between the two routers, what will R1 do with the Ethernet frame header attached by PC1?", ["remove the Ethernet header and configure a new Layer 2 header before sending it out S0/0/0"]], ["The exhibit shows the following router output:", []], ["Which two statements correctly describe the concepts of administrative distance and metric? (Choose two.)", ["Administrative distance refers to the trustworthiness of a particular route", "Routes with the smallest metric to a destination indicate the best path"]], ["Which two parameters are used by EIGRP as metrics to select the best path to reach a network? (Choose two.)​", ["bandwidth", "delay"]], ["What route would have the lowest administrative distance?", ["a directly connected network"]], ["Which two statements correctly describe the concepts of administrative distance and metric? (Choose two.)", ["Administrative distance refers to the trustworthiness of a particular route", "Routes with the smallest metric to a destination indicate the best path"]], ["Consider the following routing table entry for R1:\nD 10.1.1.0/24 [90/2170112] via 209.165.200.226, 00:00:05, Serial0/0/0\nWhat is the significance of the Serial0/0/0?", ["It is the interface on R1 used to send data that is destined for 10.1.1.0/24"]], ["The exhibit contains CLI output that says:", []], ["A network administrator configures the interface fa0/0 on the router R1 with the command ip address 172.16.1.254 255.255.255.0. However, when the administrator issues the command show ip route, the routing table does not show the directly connected network. What is the possible cause of the problem?", ["The interface fa0/0 has not been activated"]], ["A network administrator configures a router by the command ip route 0.0.0.0 0.0.0.0 209.165.200.226. What is the purpose of this command?", ["to provide a route to forward packets for which there is no route in the routing table"]], ["What are two common types of static routes in routing tables? (Choose two)", ["a default static route", "a static route to a specific network"]], ["What is the effect of configuring the ipv6 unicast-routing command on a router?", ["to enable the router as an IPv6 router"]], ["Refer to the exhibit. Match the description with the routing table entries. (Not all options are used.)", []], ["What is a basic function of the Cisco Borderless Architecture distribution layer?", ["aggregating Layer 3 routing boundaries"]], ["A network designer must provide a rationale to a customer for a design which will move an enterprise from a flat network topology to a hierarchical network topology. Which two features of the hierarchical design make it the better choice? (Choose two.)", ["easier to provide redundant links to ensure higher availability", "simpler deployment for additional switch equipment"]], ["What is a collapsed core in a network design?", ["a combination of the functionality of the distribution and core layers"]], ["Which two previously independent technologies should a network administrator attempt to combine after choosing to upgrade to a converged network infrastructure? (Choose two.)", ["user data traffic", "analog and VoIP phone traffic"]], ["What is a definition of a two-tier LAN network design?", ["distribution and core layers collapsed into one tier, and the access layer on a separate tier"]], ["A local law firm is redesigning the company network so that all 20 employees can be connected to a LAN and to the Internet. The law firm would prefer a low cost and easy solution for the project. What type of switch should be selected?", ["fixed configuration"]], ["What are two advantages of modular switches over fixed-configuration switches? (Choose two.)", ["increased scalability", "need for fewer power outlets"]], ["Refer to the exhibit. Consider that the main power has just been restored. PC3 issues a broadcast IPv4 DHCP request. To which port will SW1 forward this request?", ["to Fa0/1, Fa0/2, and Fa0/3 only"]], ["What is one function of a Layer 2 switch?", ["determines which interface is used to forward a frame based on the destination MAC address"]], ["Refer to the exhibit. How is a frame sent from PCA forwarded to PCC if the MAC address table on switch SW1 is empty?", ["SW1 floods the frame on all ports on SW1, excluding the port through which the frame entered the switch."]], ["What two criteria are used by a Cisco LAN switch to decide how to forward Ethernet frames? (Choose two.)", ["ingress port", "destination MAC address"]], ["Which network device can be used to eliminate collisions on an Ethernet network?", ["switch"]], ["Which type of address does a switch use to build the MAC address table?", ["source MAC address"]], ["What are two reasons a network administrator would segment a network with a Layer 2 switch? (Choose two.)", ["to enhance user bandwidth", "to isolate traffic between segments"]], ["Refer to the exhibit. How many broadcast domains are displayed?", ["8"]], ["Which statement describes the microsegmentation feature of a LAN switch?", ["Each port forms a collision domain."]], ["What is the destination address in the header of a broadcast frame?", ["FF-FF-FF-FF-FF-FF"]], ["Fill in the blank.", ["converged"]], ["Match the functions to the corresponding layers. (Not all options are used.)", []], ["Match the borderless switched network guideline description to the principle. (Not all options are used.)", []], ["Match the forwarding characteristic to its type. (Not all options are used.)", []], ["What is one advantage of using the cut-through switching method instead of the store-and-forward switching method?", ["has a lower latency appropriate for high-performance computing applications​"]], ["Refer to the exhibit. Consider that the main power has just been restored. PC1 asks the DHCP server for IPv4 addressing. The DHCP server sends it an IPv4 address. While PC2 is still booting up, PC3 issues a broadcast IPv4 DHCP request. To which port will SW1 forward this request?​", ["to Fa0/1, Fa0/2, and Fa0/3 only"]], ["Refer to the exhibit. Fill in the blank.", ["12"]], ["ABC, Inc. has about fifty hosts in one LAN. The administrator would like to increase the throughput of that LAN. Which device will increase the number of collision domains and thereby increase the throughput of the LAN?", ["switch"]], ["What does the term “port density” represent for an Ethernet switch?", ["the number of available ports"]], ["Which type of transmission does a switch use when the destination MAC address is not contained in the MAC address table?", ["broadcast"]], ["What information is added to the switch table from incoming frames?", ["source MAC address and incoming port number"]], ["An administrator purchases new Cisco switches that have a feature called StackPower. What is the purpose of this feature?", ["It enables the sharing of power among multiple stackable switches."]], ["Which switch form factor should be used when large port density, fault tolerance, and low price are important factors?", ["stackable switch"]], ["Refer to the exhibit. Fill in the blank.", ["5"]], ["What tool is important to consider for use when making hardware improvement decisions about switches?", ["traffic flow analysis"]], ["What is the maximum wire speed of a single port on a 48-port gigabit switch?", ["1000 Mb/s"]], ["When the installation of a network infrastructure is being planned, which technology will allow power to be provided via Ethernet cabling to a downstream switch and its connected devices?", ["PoE pass-through"]], ["Match the function to the corresponding switch type. (Not all options are used.)", []], ["Refer to the exhibit. Fill in the blank.", ["2"]], ["Match the borderless switched network guidline description to the principle (not all options used)", []]]