[["Beginning with the Cisco IOS Software Release 15.0, which license is a prerequisite for installing additional technology pack licenses?", ["IPBase"]], ["What is the major release number in the IOS image name c1900-universalk9-mz.SPA.152-3.T.bin?", ["15"]], ["Refer to the exhibit. What does the number 17:46:26.143 represent?", ["the time when the syslog message was issued"]], ["What statement describes a Cisco IOS image with the “universalk9_npe” designation for Cisco ISR G2 routers?", ["It is an IOS version that, at the request of some countries removes any strong cryptographic functionality"]], ["Refer to the exhibit. Routers R1 and R2 are connected via a serial link. One router is configured as the NTP master, and the other is an NTP client. Which two pieces of information can be obtained from the partial output of the show ntp associations detail command on R2? (Choose two.)", ["Router R1 is the master, and R2 is the client", "The IP address of R1 is 192.168.1.2"]], ["A network administrator configures a router with the command sequence:", ["The router will load IOS from the TFTP server. If the image fails to load. It will load the IOS image from ROM."]], ["What is used as the default event logging destination for Cisco routers and switches?", ["console line"]], ["When a customer purchases a Cisco IOS 15.0 software package, what serves as the receipt for that customer and is used to obtain the license as well?", ["Product Activation Key"]], ["Refer to the exhibit. Which two conclusions can be drawn from the syslog message that was generated by the router? (Choose two.)", ["This message indicates that service timestamps have been configured", "This message is a level 5 notification message"]], ["What code in the Cisco IOS 15 image filename c1900-universalk9-mz.SPA.153-3.M.bin indicates that the file is digitally signed by Cisco?", ["SPA"]], ["In addition to IPBase, what are the three technology packs that are shipped within the universal Cisco IOS Software Release 15 image? (Choose three.)", ["Security", "DATA", "Unified Communications"]], ["Which three software packages are available for Cisco IOS Release 15.0?", ["Unified Communications", "DATA", "Security"]], ["A network engineer is upgrading the Cisco IOS image on a 2900 series ISR. What command could the engineer use to verify the total amount of flash memory as well as how much flash memory is currently available?", ["show flashO:"]], ["A ping fails when performed from router R1 to directly connected router R2. The network administrator then proceeds to issue the show cdp neighbors command. Why would the network administrator issue this command if the ping failed between the two routers?", ["The network administrator wants to verify Layer 2 connectivity."]], ["Refer to the exhibit. From what location have the syslog messages been retrieved?", ["router RAM"]], ["Which command is used to configure a one-time acceptance of the EULA for all Cisco IOS software packages and features?", ["license accept end user agreement"]], ["Which command would a network engineer use to find the unique device identifier of a Cisco router?", ["show license udi"]], ["Which syslog message type is accessible only to an administrator and only via the Cisco CLI?", ["debugging"]], ["Refer to the exhibit. Match the components of the IOS image name to their description. (Not all options are used.)", []], ["The command ntp server 10.1.1.1 is issued on a router. What impact does this command have?", ["synchronizes the system clock with the time source with IP address 10.1 1 1"]], ["Which two statements are true about NTP servers in an enterprise network? (Choose two.)", ["NTP servers ensure an accurate time stamp on logging and debugging information", "NTP servers at stratum 1 are directly connected to an authoritative time source"]], ["A network administrator has issued the logging trap 4 global configuration mode command. What is the result of this command?", ["The syslog client will send to the syslog server any event message that has a seventy level of 4 and lower"]], ["Which statement is true about CDP on a Cisco device?​", ["CDP can be disabled globally or on a specific interface"]], ["Why would a network administrator issue the show cdp neigbors command on a router?", ["to display device ID and other information about directly connected Cisco devices."]], ["Which protocol or service allows network administrators to receive system messages that are provided by network devices?", ["syslog"]], ["Which two conditions should the network administrator verify before attempting to upgrade a Cisco IOS image using a TFTP server? (Choose two.)", ["Verify that there is enough flash memory for the new Cisco IOS image using the show flash command", "Verify connectivity between the router and TFTP server using the ping command"]], ["Refer to the exhibit. A network administrator is implementing the stateless DHCPv6 operation for the company. Clients are configuring IPv6 addresses as expected. However, the clients are not getting the DNS server address and the domain name information configured in the DHCP pool. What could be the cause of the problem?", ["The router is configured for SLAAC operation."]], ["Which DHCPv4 message will a client send to accept an IPv4 address that is offered by a DHCP server?", ["broadcast DHCPREQUEST"]], ["What is the reason why the DHCPREQUEST message is sent as a broadcast during the DHCPv4 process?", ["to notify other DHCP servers on the subnet that the IP address was leased"]], ["Which address does a DHCPv4 server target when sending a DHCPOFFER message to a client that makes an address request?", ["client hardware address"]], ["As a DHCPv4 client lease is about to expire, what is the message that the client sends the DHCP server?", ["DHCPREQUEST"]], ["Which set of commands will configure a router as a DHCP server that will assign IPv4 addresses to the 192.168.100.0/23 LAN while reserving the first 10 and the last addresses for static assignment?", []], ["What is an advantage of configuring a Cisco router as a relay agent?", ["It can provide relay services for multiple UDP services."]], ["An administrator issues the commands:", []], ["Under which two circumstances would a router usually be configured as a DHCPv4 client? (Choose two.)", ["The router is intended to be used as a SOHO gateway.", "This is an ISP requirement."]], ["A host on the 10.10.100.0/24 LAN is not being assigned an IPv4 address by an enterprise DHCP server with the address 10.10.200.10/24. What is the best way for the network engineer to resolve this problem?", ["Issue the command ip helper-address 10.10.200.10 on the router interface that is the 10.10.100.0/24 gateway."]], ["A company uses the SLAAC method to configure IPv6 addresses for the employee workstations. Which address will a client use as its default gateway?​", ["the link-local address of the router interface that is attached to the network"]], ["A network administrator configures a router to send RA messages with M flag as 0 and O flag as 1. Which statement describes the effect of this configuration when a PC tries to configure its IPv6 address?", ["It should use the information that is contained in the RA message and contact a DHCPv6 server for additional information."]], ["A company implements the stateless DHCPv6 method for configuring IPv6 addresses on employee workstations. After a workstation receives messages from multiple DHCPv6 servers to indicate their availability for DHCPv6 service, which message does it send to a server for configuration information?", ["DHCPv6 INFORMATION-REQUEST"]], ["An administrator wants to configure hosts to automatically assign IPv6 addresses to themselves by the use of Router Advertisement messages, but also to obtain the DNS server address from a DHCPv6 server. Which address assignment method should be configured?", ["stateless DHCPv6"]], ["How does an IPv6 client ensure that it has a unique address after it configures its IPv6 address using the SLAAC allocation method?", ["It sends an ICMPv6 Neighbor Solicitation message with the IPv6 address as the target IPv6 address."]], ["What is used in the EUI-64 process to create an IPv6 interface ID on an IPv6 enabled interface?", ["the MAC address of the IPv6 enabled interface"]], ["Refer to the exhibit. Based on the output that is shown, what kind of IPv6 addressing is being configured?", ["stateless DHCPv6"]], ["A network administrator is implementing DHCPv6 for the company. The administrator configures a router to send RA messages with M flag as 1 by using the interface command ipv6 nd managed-config-flag. What effect will this configuration have on the operation of the clients?", ["Clients must use all configuration information that is provided by a DHCPv6 server."]], ["Refer to the exhibit. What should be done to allow PC-A to receive an IPv6 address from the DHCPv6 server?", ["Add the ipv6 dhcp relay command to interface Fa0/0."]], ["Refer to the exhibit. A network administrator is implementing stateful DHCPv6 operation for the company. However, the clients are not using the prefix and prefix-length information that is configured in the DHCP pool. The administrator issues a show ipv6 interface command. What could be the cause of the problem?", ["The router is configured for stateless DHCPv6 operation."]], ["Fill in the blank. Do not abbreviate.", []], ["A company uses DHCP servers to dynamically assign IPv4 addresses to employee workstations. The address lease duration is set as 5 days. An employee returns to the office after an absence of one week. When the employee boots the workstation, it sends a message to obtain an IP address. Which Layer 2 and Layer 3 destination addresses will the message contain?", ["FF-FF-FF-FF-FF-FF and 255.255.255.255"]], ["Which is a DHCPv4 address allocation method that assigns IPv4 addresses for a limited lease period?", ["dynamic allocation"]], ["A network engineer is troubleshooting hosts on a LAN that are not being assigned an IPv4 address from a DHCP server after a new Ethernet switch has been installed on the LAN. The configuration of the DHCP server has been confirmed as correct and the clients have network connectivity to other networks if a static IP address is configured on each one. What step should the engineer take next to solve the issue?", ["Confirm that ports on the Layer 2 LAN switch are configured as edge ports."]], ["A company uses the method SLAAC to configure IPv6 addresses for the workstations of the employees. A network administrator configured the IPv6 address on the LAN interface of the router. The interface status is UP. However, the workstations on the LAN segment did not obtain the correct prefix and prefix length. What else should be configured on the router that is attached to the LAN segment for the workstations to obtain the information?", ["R1(config)# ipv6 unicast-routing"]], ["Which protocol supports Stateless Address Autoconfiguration (SLAAC) for dynamic assignment of IPv6 addresses to a hos", ["ICMPv6"]], ["Match the descriptions to the corresponding DHCPv6 server type. (Not all options are used.)", []], ["Launch PT Hide and Save PT", []], ["Order the steps of configuring a router as a DHCPv4 server. (Not all options are used.)", []]]