[["What are two advantages of static routing over dynamic routing? (Choose two.)", ["Static routing is more secure because it does not advertise over the network.", "Static routing uses fewer router resources than dynamic routing."]], ["Refer to the exhibit. What routing solution will allow both PC A and PC B to access the Internet with the minimum amount of router CPU and network bandwidth utilization?", ["Configure a static default route from R1 to Edge, a default route from Edge to the Internet, and a static route from Edge to R1."]], ["What is the correct syntax of a floating static route?", ["ip route 209.165.200.228 255.255.255.248 10.0.0.1 120"]], ["What is a characteristic of a static route that matches all packets?", ["It identifies the gateway IP address to which the router sends all IP packets for which it does not have a learned or static route."]], ["What type of route allows a router to forward packets even though its routing table contains no specific route to the destination network?", ["default route"]], ["Why would a floating static route be configured with an administrative distance that is higher than the administrative distance of a dynamic routing protocol that is running on the same router?", ["to be used as a backup route"]], ["A company has several networks with the following IP address requirements:", []], ["What happens to a static route entry in a routing table when the outgoing interface associated with that route goes into the down state?", ["The static route is removed from the routing table."]], ["The network administrator configures the router with the ip route 172.16.1.0 255.255.255.0 172.16.2.2 command. How will this route appear in the routing table?", ["S 172.16.1.0 [1/0] via 172.16.2.2"]], ["Graphic shows output of show ip route as follows:", []], ["Which type of static route that is configured on a router uses only the exit interface?", ["directly connected static route"]], ["Refer to the graphic. Which command would be used on router A to configure a static route to direct traffic from LAN A that is destined for LAN C?", ["A(config)# ip route 192.168.4.0 255.255.255.0 192.168.3.2"]], ["Refer to the exhibit. The network administrator needs to configure a default route on the Border router. Which command would the administrator use to configure a default route that will require the least amount of router processing when forwarding packets?", ["Border(config)# ip route 0.0.0.0 0.0.0.0 s0/0/1"]], ["What two pieces of information are needed in a fully specified static route to eliminate recursive lookups? (Choose two.)", ["the interface ID exit interface", "the IP address of the next-hop neighbor"]], ["Refer to the exhibit. What command would be used to configure a static route on R1 so that traffic from both LANs can reach the 2001:db8:1:4::/64 remote network?", ["ipv6 route 2001:db8:1:4::/64 2001:db8:1:3::2"]], ["Refer to the exhibit. Which default static route command would allow R1 to potentially reach all unknown networks on the Internet?", ["R1(config)# ipv6 route ::/0 G0/1 fe80::2"]], ["Consider the following command:\nip route 192.168.10.0 255.255.255.0 10.10.10.2 5\nWhich route would have to go down in order for this static route to appear in the routing table?", ["a static route to the 192.168.10.0/24 network"]], ["Refer to the exhibit. The routing table for R2 is as follows:", []], ["A network administrator has entered a static route to an Ethernet LAN that is connected to an adjacent router. However, the route is not shown in the routing table. Which command would the administrator use to verify that the exit interface is up?", ["show ip interface brief"]], ["Consider the following command:\nip route 192.168.10.0 255.255.255.0 10.10.10.2 5\nHow would an administrator test this configuration?", ["Manually shut down the router interface used as a primary route."]], ["R1 router has a serial connection to the ISP out s0/0/1. R1 router has the 10.0.30.0/24 LAN connected to G0/0. R1 has the 10.0.40.0/24 LAN connected to G0/1. Finally, R1 has the s0/0/0 10.0.50.0/24 network shared with R2. R2 also has the 10.0.60.0/24 LAN connected through G0/0. The following information is below R1.", []], ["Which three IOS troubleshooting commands can help to isolate problems with a static route? (Choose three.)", ["ping", "show ip route", "show ip interface brief"]], ["An administrator issues the ipv6 route 2001:db8:acad:1::/32 gigabitethernet0/0 2001:db8:acad:6::1 100 command on a router. What administrative distance is assigned to this route?", ["100"]], ["Refer to the exhibit. The network engineer for the company that is shown wants to use the primary ISP connection for all external connectivity. The backup ISP connection is used only if the primary ISP connection fails. Which set of commands would accomplish this goal?", ["ip route 0.0.0.0 0.0.0.0 s0/0/0*\nip route 0.0.0.0 0.0.0.0 s0/1/0 10"]], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question.\nWhy are the pings from PC0 to Server0 not successful?", ["The static route to network 192.168.2.0 is misconfigured on Router1.​"]], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question. What IPv6 static route can be configured on router R1 to make a fully converged network?", ["ipv6 route 2001:db8:10:12::/64 S0/0/1"]], ["Which interface is the default location that would contain the IP address used to manage a 24-port Ethernet switch?", ["VLAN 1"]], ["Which statement describes the port speed LED on the Cisco Catalyst 2960 switch?", ["If the LED is green, the port is operating at 100 Mb/s."]], ["What is a function of the switch boot loader?", ["to provide an environment to operate in when the switch operating system cannot be found"]], ["In which situation would a technician use the show interfaces switch command?", ["when packets are being dropped from a particular directly attached host"]], ["Refer to the exhibit. A network technician is troubleshooting connectivity issues in an Ethernet network with the command show interfaces fastEthernet 0/0. What conclusion can be drawn based on the partial output in the exhibit?", ["A malfunctioning NIC can cause frames to be transmitted that are longer than the allowed maximum length."]], ["Refer to the exhibit. The network administrator wants to configure Switch1 to allow SSH connections and prohibit Telnet connections. How should the network administrator change the displayed configuration to satisfy the requirement?", ["Modify the transport input command."]], ["What is one difference between using Telnet or SSH to connect to a network device for management purposes?", ["Telnet sends a username and password in plain text, whereas SSH encrypts the username and password"]], ["In which type of attack does a malicious node request all available IP addresses in the address pool of a DHCP server in order to prevent legitimate hosts from obtaining network access?​", ["DHCP starvation"]], ["Which method would mitigate a MAC address flooding attack?", ["configuring port security"]], ["Which two features on a Cisco Catalyst switch can be used to mitigate DHCP starvation and DHCP spoofing attacks? (Choose two.)", ["port security", "DHCP snooping"]], ["Which two basic functions are performed by network security tools? (Choose two.)", ["revealing the type of information an attacker is able to gather from monitoring network traffic", "simulating attacks against the production network to determine any existing vulnerabilities"]], ["An administrator wants to use a network security auditing tool on a switch to verify which ports are not protected against a MAC flooding attack. For the audit to be successful, what important factor must the administrator consider?", ["the aging-out period of the MAC address table"]], ["Which action will bring an error-disabled switch port back to an operational state?", ["Issue the shutdown and then no shutdown interface commands."]], ["Refer to the exhibit. Port Fa0/2 has already been configured appropriately. The IP phone and PC work properly. Which switch configuration would be most appropriate for port Fa0/2 if the network administrator has the following goals?", ["SWA(config-if)# switchport port-security*\nSWA(config-if)# switchport port-security maximum 2*\nSWA(config-if)# switchport port-security mac-address sticky"]], ["Which two statements are true regarding switch port security? (Choose two.)", ["Dynamically learned secure MAC addresses are lost when the switch reboots.", "If fewer than the maximum number of MAC addresses for a port are configured statically, dynamically learned addresses are added to CAM until the maximum number is reached."]], ["A network administrator configures the port security feature on a switch. The security policy specifies that each access port should allow up to two MAC addresses. When the maximum number of MAC addresses is reached, a frame with the unknown source MAC address is dropped and a notification is sent to the syslog server. Which security violation mode should be configured for each access port?", ["restrict"]], ["Refer to the exhibit. What can be determined about port security from the information that is shown?", ["The port violation mode is the default for any port that has port security enabled."]], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question.\nFill in the blank.\nDo not use abbreviations.What is the missing command on S1?", ["ip address 192.168.99.2 255.255.255.0"]], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question. Which event will take place if there is a port security violation on switch S1 interface Fa0/1?", ["Packets with unknown source addresses will be dropped."]], ["What impact does the use of the mdix auto configuration command haveon an Ethernet interface on a switch?", ["automatically detects copper cable type"]], ["Which type of cable does a network administrator need to connect a PC to a switch to recover it after the Cisco IOS software fails to load?", ["a console cable"]], ["While troubleshooting a connectivity problem, a network administrator notices that a switch port status LED is alternating between green and amber. What could this LED indicate?", ["The port is experiencing errors."]], ["A production switch is reloaded and finishes with a Switch> prompt. What two facts can be determined? (Choose two.)", ["POST occurred normally.", "A full version of the Cisco IOS was located and loaded."]], ["Which command displays information about the auto-MDIX setting for a specific interface?", ["show controllers"]], ["Refer to the exhibit. What media issue might exist on the link connected to Fa0/1 based on the show interface command?", ["There could be too much electrical interference and noise on the link."]], ["Which protocol or service sends broadcasts containing the Cisco IOS software version of the sending device, and the packets of which can be captured by malicious hosts on the network?", ["CDP"]], ["Refer to the exhibit. Which S1 switch port interface or interfaces should be configured with the ip dhcp snooping trust command if best practices are implemented?", ["only the G0/1 and G0/24 ports", "only the G0/2, G0/3, and G0/4 ports"]], ["The network administrator enters the following commands on a Cisco switch:\nSwitch(config)# interface vlan1\nSwitch(config-if)# ip address 192.168.1.2 255.255.255.0\nSwitch(config-if)# no shutdown\nWhat is the effect of entering these commands?", ["Users on the 192.168.1.0/24 subnet are able to ping the switch at IP address 192.168.1.2."]], ["Fill in the blank.", []], ["Which three statements are true about using full-duplex Fast Ethernet? (Choose three.)", ["Performance is improved with bidirectional data flow.", "Full-duplex Fast Ethernet offers 100 percent efficiency in both directions.", "Performance is improved because the collision detect function is disabled on the device."]], ["Fill in the blank.", []], ["Place the options in the following order:", []], ["Identify the steps needed to configure a switch for SSH.", []], ["Match the Link State to the interface and protocol status.", []]]