[["A network designer must provide a rationale to a customer for a design which will move an enterprise from a flat network topology to a hierarchical network topology. Which two features of the hierarchical design make it the better choice? (Choose two.)", ["easier to provide redundant links to ensure higher availability", "simpler deployment for additional switch equipment"]], ["What is a collapsed core in a network design?", ["a combination of the functionality of the distribution and core layers"]], ["What is a definition of a two-tier LAN network design?", ["distribution and core layers collapsed into one tier, and the access layer on a separate tier"]], ["What is a basic function of the Cisco Borderless Architecture distribution layer?", ["aggregating Layer 3 routing boundaries"]], ["Which two previously independent technologies should a network administrator attempt to combine after choosing to upgrade to a converged network infrastructure? (Choose two.)", ["user data traffic", "VoIP phone traffic"]], ["A local law firm is redesigning the company network so that all 20 employees can be connected to a LAN and to the Internet. The law firm would prefer a low cost and easy solution for the project. What type of switch should be selected?", ["fixed configuration"]], ["What are two advantages of modular switches over fixed-configuration switches? (Choose two.)", ["increased scalability", "need for fewer power outlets"]], ["Which type of address does a switch use to build the MAC address table?", ["source MAC address"]], ["Which network device can be used to eliminate collisions on an Ethernet network?", ["switch"]], ["What two criteria are used by a Cisco LAN switch to decide how to forward Ethernet frames? (Choose two.)", ["ingress port", "destination MAC address"]], ["Refer to the exhibit. Consider that the main power has just been restored. PC3 issues a broadcast IPv4 DHCP request. To which port will SW1 forward this request?​", ["to Fa0/1, Fa0/2, and Fa0/3 only"]], ["What is one function of a Layer 2 switch?", ["determines which interface is used to forward a frame based on the destination MAC address"]], ["Refer to the exhibit. How is a frame sent from PCA forwarded to PCC if the MAC address table on switch SW1 is empty?", ["SW1 floods the frame on all ports on SW1, excluding the port through which the frame entered the switch."]], ["A small publishing company has a network design such that when a broadcast is sent on the LAN, 200 devices receive the transmitted broadcast. How can the network administrator reduce the number of devices that receive broadcast traffic?", ["Segment the LAN into smaller LANs and route between them."]], ["Refer to the exhibit. How many broadcast domains are displayed?", ["8"]], ["Which solution would help a college alleviate network congestion due to collisions?", ["a high port density switch"]], ["Which network device can serve as a boundary to divide a Layer 2 broadcast domain?", ["router"]], ["What is the destination address in the header of a broadcast frame?", ["FF-FF-FF-FF-FF-FF"]], ["Which statement describes a result after multiple Cisco LAN switches are interconnected?", ["The broadcast domain expands to all switches."]], ["What does the term “port density” represent for an Ethernet switch?", ["the number of available ports"]], ["What are two reasons a network administrator would segment a network with a Layer 2 switch? (Choose two.)", ["to enhance user bandwidth", "to isolate traffic between segments"]], ["Fill in the blank.", []], ["Match the borderless switched network guideline description to the principle. (Not all options are used.)", []], ["Match the functions to the corresponding layers. (Not all options are used.)", []], ["Match the forwarding characteristic to its type. (Not all options are used.)", []], ["What are two functions of a router? (Choose two.)", ["It connects multiple IP networks.", "It determines the best path to send packets."]], ["Which two statements correctly describe the concepts of administrative distance and metric? (Choose two.)", ["Administrative distance refers to the trustworthiness of a particular route.", "Routes with the smallest metric to a destination indicate the best path."]], ["In order for packets to be sent to a remote destination, what three pieces of information must be configured on a host? (Choose three.)", ["IP address", "subnet mask", "default gateway"]], ["Which software is used for a network administrator to make the initial router configuration securely?", ["terminal emulation client software"]], ["Refer to the exhibit. PC A sends a request to Server B. What IPv4 address is used in the destination field in the packet as the packet leaves PC A?", ["192.168.12.16"]], ["Refer to the exhibit. A network administrator has configured R1 as shown. When the administrator checks the status of the serial interface, the interface is shown as being administratively down. What additional command must be entered on the serial interface of R1 to bring the interface up?", ["no shutdown"]], ["What is a characteristic of an IPv4 loopback interface on a Cisco IOS router?​", ["It is a logical interface internal to the router."]], ["What two pieces of information are displayed in the output of the show ip interface brief command? (Choose two.)", ["IP addresses", "Layer 1 statuses"]], ["What type of network uses one common infrastructure to carry voice, data, and video signals?", ["converged"]], ["A packet moves from a host on one network to a device on a remote network within the same company. If NAT is not performed on the packet, which two items remain unchanged during the transfer of the packet from source to destination? (Choose two.)", ["destination IP address", "source IP address"]], ["Which two items are used by a host device when performing an ANDing operation to determine if a destination address is on the same local network? (Choose two.)", ["destination IP address", "subnet mask"]], ["Refer to the exhibit. If PC1 is sending a packet to PC2 and routing has been configured between the two routers, what will R1 do with the Ethernet frame header attached by PC1?", ["remove the Ethernet header and configure a new Layer 2 header before sending it out S0/0/0"]], ["Refer to the exhibit. What does R1 use as the MAC address of the destination when constructing the frame that will go from R1 to Server B?", ["If the destination MAC address that corresponds to the IPv4 address is not in the ARP cache, R1 sends an ARP request."]], ["Refer to the exhibit. What will the router do with a packet that has a destination IP address of 192.168.12.227?", ["Send the packet out the Serial0/0/0 interface."]], ["Which two parameters are used by EIGRP as metrics to select the best path to reach a network? (Choose two.)​", ["bandwidth", "delay"]], ["What route would have the lowest administrative distance?", ["a directly connected network"]], ["Consider the following routing table entry for R1:\nD 10.1.1.0/24 [90/2170112] via 209.165.200.226, 00:00:05, Serial0/0/0\nWhat is the significance of the Serial0/0/0?", ["It is the interface on R1 used to send data that is destined for 10.1.1.0/24."]], ["What are two common types of static routes in routing tables? (Choose two)", ["a default static route", "a static route to a specific network"]], ["What command will enable a router to begin sending messages that allow it to configure a link-local address without using an IPv6 DHCP server?", ["the ipv6 unicast-routing command"]], ["What is one feature that distinguishes routers from Layer 2 switches?", ["Routers support a variety of interface types. Switches typically support Ethernet interfaces."]], ["What type of IPv6 address is required as a minimum on IPv6 enabled interfaces?", ["link-local"]], ["When a computer is pinging another computer for the first time, what type of message does it place on the network to determine the MAC address of the other device?", ["an ARP request"]], ["What address changes as a packet travels across multiple Layer 3 Ethernet hops to its final destination?", ["source Layer 2 address"]], ["Refer to the exhibit. A network administrator issues the show ipv6 route command on R1. What two conclusions can be drawn from the routing table? (Choose two.)", ["local host route", "directly connected network"]], ["Refer to the exhibit. A network administrator issues the show ip route command on R2. What two types of routes are installed in the routing table? (Choose two.)", ["directly connected networks", "routes that are learned through the EIGRP routing protocol"]], ["What type of IPv6 address is required as a minimum on IPv6 enabled interfaces?", ["link-local"]], ["Match the forwarding characteristic to its type. (Not all options are used.)", []], ["Refer to the exhibit. A network administrator issues the show ipv6 route command on R1. What two conclusions can be drawn from the routing table? (Choose two.)", ["R1 does not know a route to any remote networks.", "The interface Fa0/1 is configured with IPv6 address 2001:DB8:ACAD:A::12."]], ["Refer to the exhibit. What is the purpose of the highlighted field in the line that is displayed from the show ip route command?", ["It indicates that this route was learned via EIGRP."]], ["Refer to the exhibit. PC1 attempts to connect to File_server1 and sends an ARP request to obtain a destination MAC address. Which MAC address will PC1 receive in the ARP reply?", ["the MAC address of the G0/0 interface on R1"]], ["A network administrator configures the interface fa0/0 on the router R1 with the command ip address 172.16.1.254 255.255.255.0. However, when the administrator issues the command show ip route, the routing table does not show the directly connected network. What is the possible cause of the problem?", ["The interface fa0/0 has not been activated."]], ["Which command is used to configure an IPv6 address on a router interface so that the router will combine a manually specified network prefix with an automatically generated interface identifier?", ["ipv6 address ipv6-address/prefix-length eui-64"]], ["Fill in the blank.", []], ["A network administrator configures a router by the command ip route 0.0.0.0 0.0.0.0 209.165.200.226. What is the purpose of this command?", ["to provide a route to forward packets for which there is no route in the routing table"]], ["Refer to the exhibit. A network administrator issues the show ipv6 route command on R1. Which two types of routes are displayed in the routing table? (Choose two.)", ["directly connected network", "local host route"]], ["A network administrator is implementing dynamic routing protocols for a company. Which command can the administrator issue on a router to display the supported routing protocols?", ["Router(config)# router ?"]], ["Which statement describes a route that has been learned dynamically?", ["It is automatically updated and maintained by routing protocols."]], ["Which two network parameters are used by EIGRP as metrics to select the best path to reach a network? (Choose Two.)", ["bandwidth", "delay"]], ["What are two types of static routes in routing tables? (choose two)", ["default static route", "static route to specific network"]], ["What is a characteristic of an IPv4 interface on a Cisco IOS router?", ["it is a logical int internal to the router"]]]