[["Which statement describes the port speed LED on the Cisco Catalyst 2960 switch?", ["If the LED is green, the port is operating at 100 Mb/s."]], ["Which command is used to set the BOOT environment variable that defines where to find the IOS image file on a switch?", ["boot system"]], ["What is a function of the switch boot loader?", ["to provide an environment to operate in when the switch operating system cannot be found"]], ["Which interface is the default location that would contain the IP address used to manage a 24-port Ethernet switch?", ["VLAN 1"]], ["A production switch is reloaded and finishes with a Switch> prompt. What two facts can be determined? (Choose two.)", ["POST occurred normally.", "A full version of the Cisco IOS was located and loaded."]], ["Which two statements are true about using full-duplex Fast Ethernet? (Choose two.)", ["Performance is improved with bidirectional data flow.", "Full-duplex Fast Ethernet offers 100 percent efficiency in both directions."]], ["In which situation would a technician use the show interfaces switch command?", ["when packets are being dropped from a particular directly attached host"]], ["Refer to the exhibit. A network technician is troubleshooting connectivity issues in an Ethernet network with the command show interfaces fastEthernet 0/0. What conclusion can be drawn based on the partial output in the exhibit?", ["A malfunctioning NIC can cause frames to be transmitted that are longer than the allowed maximum length."]], ["Refer to the exhibit. What media issue might exist on the link connected to Fa0/1 based on the show interface command?", ["There could be too much electrical interference and noise on the link."]], ["If one end of an Ethernet connection is configured for full duplex and the other end of the connection is configured for half duplex, where would late collisions be observed?", ["on the half-duplex end of the connection"]], ["What is one difference between using Telnet or SSH to connect to a network device for management purposes?", ["Telnet sends a username and password in plain text, whereas SSH encrypts the username and password."]], ["Refer to the exhibit. The network administrator wants to configure Switch1 to allow SSH connections and prohibit Telnet connections. How should the network administrator change the displayed configuration to satisfy the requirement?", ["Modify the transport input command."]], ["What is the effect of using the switchport port-security command?", ["enables port security on an interface"]], ["Where are dynamically learned MAC addresses stored when sticky learning is enabled with the switchport port-security mac-address sticky command?", ["RAM"]], ["A network administrator configures the port security feature on a switch. The security policy specifies that each access port should allow up to two MAC addresses. When the maximum number of MAC addresses is reached, a frame with the unknown source MAC address is dropped and a notification is sent to the syslog server. Which security violation mode should be configured for each access port?", ["restrict"]], ["Which two statements are true regarding switch port security? (Choose two.)", ["Dynamically learned secure MAC addresses are lost when the switch reboots.", "If fewer than the maximum number of MAC addresses for a port are configured statically, dynamically learned addresses are added to CAM until the maximum number is reached."]], ["Which action will bring an error-disabled switch port back to an operational state?", ["Issue the shutdown and then no shutdown interface commands."]], ["Refer to the exhibit. Port Fa0/2 has already been configured appropriately. The IP phone and PC work properly. Which switch configuration would be most appropriate for port Fa0/2 if the network administrator has the following goals?", []], ["The following words are displayed:", []], ["Refer to the exhibit. Which event will take place if there is a port security violation on switch S1 interface Fa0/1?", ["Packets with unknown source addresses will be dropped."]], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question.\nWhich event will take place if there is a port security violation on switch S1 interface Fa0/1?", []], ["Fill in the blank.", []], ["Match the step to each switch boot sequence description. (Not all options are used.)", []], ["Identify the steps needed to configure a switch for SSH. The answer order does not matter. (Not all options are used.)", []], ["What is a disadvantage of using router-on-a-stick inter-VLAN routing?", ["does not scale well beyond 50 VLANs"]], ["How is traffic routed between multiple VLANs on a multilayer switch?", ["Traffic is routed via internal VLAN interfaces."]], ["Refer to the exhibit. In this network design, which connection or connections if any, add the VLAN ID number if host H1 sends information to host H2?", ["no link"]], ["What is a characteristic of legacy inter-VLAN routing?", ["The router requires one Ethernet link for each VLAN."]], ["Refer to the exhibit. A network administrator needs to configure router-on-a-stick for the networks that are shown. How many subinterfaces will have to be created on the router if each VLAN that is shown is to be routed and each VLAN has its own subinterface?", ["4"]], ["Refer to the exhibit. In what switch mode should port G0/1 be assigned if Cisco best practices are being used?", ["trunk"]], ["Refer to the exhibit. What is the problem with this configuration, based on the output of the router?", ["The encapsulation has not been configured on the subinterface."]], ["Refer to the exhibit. Communication between the VLANs is not occurring. What could be the issue?", ["The Gi1/1 switch port is not in trunking mode."]], ["Refer to the exhibit. A network administrator is verifying the configuration of inter-VLAN routing. Users complain that PCs on different VLANs cannot communicate. Based on the output, what are two configuration errors on switch interface Gi1/1? (Choose two.)", ["Gi1/1 is in the default VLAN.", "Gi1/1 is configured as trunk mode."]], ["Refer to the exhibit. A network administrator is verifying the configuration of inter-VLAN routing. Users complain that PC2 cannot communicate with PC1. Based on the output, what is the possible cause of the problem?", ["The encapsulation dot1Q 5 command contains the wrong VLAN."]], ["Refer to the exhibit. A network administrator is verifying the configuration of inter-VLAN routing. Based on the partial output that is displayed by the use of the show vlan command, which conclusion can be drawn for the Gi1/1 interface?", ["It is configured as trunk mode."]], ["Inter-VLAN communication is not occurring in a particular building of a school. Which two commands could the network administrator use to verify that inter-VLAN communication was working properly between a router and a Layer 2 switch when the router-on-a-stick design method is implemented? (Choose two.)", ["From the router, issue the show ip route command.", "From the switch, issue the show interfaces trunk command."]], ["How are IP addressing designs affected by VLAN implementations?", ["Each VLAN must have a different network number."]], ["While configuring inter-VLAN routing on a multilayer switch, a network administrator issues the no switchport command on an interface that is connected to another switch. What is the purpose of this command?", ["to create a routed port for a single network"]], ["What is a disadvantage of using multilayer switches for inter-VLAN routing?", ["Multilayer switches are more expensive than router-on-a-stick implementations."]], ["What is a characteristic of a routed port on a Layer 3 switch?", ["It is not assigned to a VLAN."]], ["An administrator is attempting to configure a static route on a Cisco 2960 series switch. After the administrator types the command ip route 0.0.0.0 0.0.0.0 10.1.1.1, an error message appears stating that the command is not recognized. What must the administrator do so that this command is accepted?", ["Enter the command sdm prefer lanbase-routing and reload."]], ["Which statement describes a disadvantage of using router subinterfaces for inter-VLAN routing?", ["Routed traffic must contend for bandwidth on a single router interface."]], ["Refer to the exhibit. Router RA receives a packet with a source address of 192.168.1.35 and a destination address of 192.168.1.85. What will the router do with this packet?", ["The router will forward the packet out interface FastEthernet 0/1.2."]], ["Refer to the exhibit. After attempting to enter the configuration that is shown in router RTA, an administrator receives an error and users on VLAN 20 report that they are unable to reach users on VLAN 30. What is causing the problem?", ["RTA is using the same subnet for VLAN 20 and VLAN 30."]], ["Refer to the exhibit. A network administrator is configuring RT1 for inter-VLAN routing. The switch is configured correctly and is functional. Host1, Host2, and Host3 cannot communicate with each other. Based on the router configuration, what is causing the problem?", ["IP addresses on the subinterfaces are incorrectly matched to the VLANs."]], ["What condition is required to enable Layer 3 switching?", ["The Layer 3 switch must have IP routing enabled."]], ["Refer to the exhibit. Which command can the administrator issue to change the VLAN10 status to up?​", []], ["Fill in the blank. Do not use abbreviations.", []], ["Refer to the exhibit. The switch does the routing for the hosts that connect to VLAN 5. If the PC accesses a web server from the Internet, at what point will a VLAN number be added to the frame?", ["No VLAN number is added to the frame in this design."]], ["Which type of inter-VLAN communication design requires the configuration of multiple subinterfaces?", ["router on a stick"]], ["A small college uses VLAN 10 for the classroom network and VLAN 20 for the office network. What is needed to enable communication between these two VLANs while using legacy inter-VLAN routing?", ["A router with at least two LAN interfaces should be used."]], ["Refer to the exhibit. A network administrator has configured router CiscoVille with the above commands to provide inter-VLAN routing. What command will be required on a switch that is connected to the Gi0/0 interface on router CiscoVille to allow inter-VLAN routing??", ["switchport mode trunk"]], ["Refer to the exhibit. A router-on-a-stick configuration was implemented for VLANs 15, 30, and 45, according to the show running-config command output. PCs on VLAN 45 that are using the 172.16.45.0 /24 network are having trouble connecting to PCs on VLAN 30 in the 172.16.30.0 /24 network. Which error is most likely causing this problem??", ["There is an incorrect IP address configured on GigabitEthernet 0/0.30."]], ["Match the link state to the interface and protocol status. (Not all options are used.)", []], ["Match the inter-VLAN routing method to the corresponding characteristic (not all options are used).", []], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question. Fill in the blank. Do not use abbreviations.Which command is missing on the Layer 3 switch to restore the full connectivity between PC1 and the web server? (Note that typing no shutdown will not fix this problem.)", []], ["Packet Tracer activity\nWhat the missing command on layer 3 switch which allow communication between PC1 and Web Server?", []]]