[["What are three primary benefits of using VLANs? (Choose three.)", ["security", "cost reduction", "improved IT staff efficiency"]], ["Which type of VLAN is used to designate which traffic is untagged when crossing a trunk port?", ["native"]], ["A network administrator is determining the best placement of VLAN trunk links. Which two types of point-to-point connections utilize VLAN trunking?​ (Choose two.)", ["between two switches that utilize multiple VLANs", "between a switch and a server that has an 802.1Q NIC"]], ["What must the network administrator do to remove Fast Ethernet port fa0/1 from VLAN 2 and assign it to VLAN 3?", ["Enter the switchport access vlan 3 command in interface configuration mode."]], ["When a Cisco switch receives untagged frames on a 802.1Q trunk port, which VLAN ID is the traffic switched to by default?", ["native VLAN ID"]], ["Port Fa0/11 on a switch is assigned to VLAN 30. If the command no switchport access vlan 30 is entered on the Fa0/11 interface, what will happen?", ["Port Fa0/11 will be returned to VLAN 1."]], ["Which command is used to remove only VLAN 20 from a switch?", ["no vlan 20"]], ["What happens to a port that is associated with VLAN 10 when the administrator deletes VLAN 10 from the switch?", ["The port becomes inactive."]], ["Which two characteristics match extended range VLANs? (Choose two.)", ["VLAN IDs exist between 1006 to 4094.", "They are saved in the running-config file by default."]], ["A Cisco switch currently allows traffic tagged with VLANs 10 and 20 across trunk port Fa0/5. What is the effect of issuing a switchport trunk allowed vlan 30 command on Fa0/5?", ["It allows only VLAN 30 on Fa0/5."]], ["Refer to the exhibit. PC-A and PC-B are both in VLAN 60. PC-A is unable to communicate with PC-B. What is the problem?", ["The VLAN that is used by PC-A is not in the list of allowed VLANs on the trunk."]], ["Refer to the exhibit. DLS1 is connected to another switch, DLS2, via a trunk link. A host that is connected to DLS1 is not able to communicate to a host that is connected to DLS2, even though they are both in VLAN 99. Which command should be added to Fa0/1 on DLS1 to correct the problem?", ["switchport trunk native vlan 66"]], ["What is a characteristic of legacy inter-VLAN routing?", ["The router requires one Ethernet link for each VLAN."]], ["Which four steps are needed to configure a voice VLAN on a switch port? (Choose four).", ["Configure the switch port in access mode.", "Add a voice VLAN.", "Assign the voice VLAN to the switch port.", "Ensure that voice traffic is trusted and tagged with a CoS priority value."]], ["What is a disadvantage of using router-on-a-stick inter-VLAN routing?", ["does not scale well beyond 50 VLANs"]], ["Refer to the exhibit. Router RA receives a packet with a source address of 192.168.1.35 and a destination address of 192.168.1.85. What will the router do with this packet?", ["The router will forward the packet out interface FastEthernet 0/1.2."]], ["Refer to the exhibit. In what switch mode should port G0/1 be assigned if Cisco best practices are being used?", ["trunk"]], ["A small college uses VLAN 10 for the classroom network and VLAN 20 for the office network. What is needed to enable communication between these two VLANs while using legacy inter-VLAN routing?", ["A router with at least two LAN interfaces should be used."]], ["Refer to the exhibit. A network administrator needs to configure router-on-a-stick for the networks that are shown. How many subinterfaces will have to be created on the router if each VLAN that is shown is to be routed and each VLAN has its own subinterface?", ["4"]], ["When configuring a router as part of a router-on-a-stick inter-VLAN routing topology, where should the IP address be assigned?", ["to the subinterface"]], ["A high school uses VLAN15 for the laboratory network and VLAN30 for the faculty network. What is required to enable communication between these two VLANs while using the router-on-a-stick approach?", ["A switch with a port that is configured as a trunk is needed when connecting to the router."]], ["Refer to the exhibit. A router-on-a-stick configuration was implemented for VLANs 15, 30, and 45, according to the show running-config command output. PCs on VLAN 45 that are using the 172.16.45.0 /24 network are having trouble connecting to PCs on VLAN 30 in the 172.16.30.0 /24 network. Which error is most likely causing this problem?​", ["There is an incorrect IP address configured on GigabitEthernet 0/0.30."]], ["Match the IEEE 802.1Q standard VLAN tag field with the descriptions. (Not all options are used.)", []], ["Fill in the blank. Use the full command syntax.", []], ["Open the PT Activity. Perform the tasks in the activity instructions and then answer the question.", []], ["Refer to the exhibit. What command would be used to configure a static route on R1 so that traffic from both LANs can reach the 2001:db8:1:4::/64 remote network?", ["ipv6 route 2001:db8:1:4::/64 2001:db8:1:3::2"]], ["Refer to the exhibit. The network engineer for the company that is shown wants to use the primary ISP connection for all external connectivity. The backup ISP connection is used only if the primary ISP connection fails. Which set of commands would accomplish this goal?", []], ["Refer to the exhibit. What routing solution will allow both PC A and PC B to access the Internet with the minimum amount of router CPU and network bandwidth utilization?", ["Configure a static default route from R1 to Edge, a default route from Edge to the Internet, and a static route from Edge to R1."]], ["What are two advantages of static routing over dynamic routing? (Choose two.)", ["Static routing is more secure because it does not advertise over the network.", "Static routing uses fewer router resources than dynamic routing."]], ["What type of route allows a router to forward packets even though its routing table contains no specific route to the destination network?", ["default route"]], ["Why would a floating static route be configured with an administrative distance that is higher than the administrative distance of a dynamic routing protocol that is running on the same router?", ["to be used as a backup route"]], ["What is the correct syntax of a floating static route?", ["ip route 209.165.200.228 255.255.255.248 10.0.0.1 120"]], ["Which type of static route that is configured on a router uses only the exit interface?", ["directly connected static route"]], ["Refer to the graphic. Which command would be used on router A to configure a static route to direct traffic from LAN A that is destined for LAN C?", ["A(config)# ip route 192.168.4.0 255.255.255.0 192.168.3.2"]], ["The network administrator configures the router with the ip route 172.16.1.0 255.255.255.0 172.16.2.2 command. How will this route appear in the routing table?", ["S 172.16.1.0 [1/0] via 172.16.2.2"]], ["Refer to the exhibit. R1 receives a packet destined for the IP address 192.168.2.10. Out which interface will R1 forward the packet?", ["Serial0/0/1"]], ["Refer to the exhibit. The network administrator needs to configure a default route on the Border router. Which command would the administrator use to configure a default route that will require the least amount of router processing when forwarding packets?", ["Border(config)# ip route 0.0.0.0 0.0.0.0 s0/0/1"]], ["What two pieces of information are needed in a fully specified static route to eliminate recursive lookups? (Choose two.)", ["the interface ID exit interface", "the IP address of the next-hop neighbor"]], ["A network administrator issues the show vlan brief command while troubleshooting a user support ticket. What output will be displayed?", ["the VLAN assignment and membership for all switch ports"]], ["Refer to the exhibit. Which default static route command would allow R1 to potentially reach all unknown networks on the Internet?", ["R1(config)# ipv6 route ::/0 G0/1 fe80::2"]], ["Which two statements describe classful IP addresses? (Choose two.)", ["The number of bits used to identify the hosts is fixed by the class of the network.", "All subnets in a network are the same size."]], ["What would be the first step in calculating a summarized route for 5 networks?", ["Write all network numbers in binary."]], ["A company has several networks with the following IP address requirements:", []], ["Consider the following command:\nip route 192.168.10.0 255.255.255.0 10.10.10.2 5\nHow would an administrator test this configuration?", ["Manually shut down the router interface used as a primary route."]], ["What happens to a static route entry in a routing table when the outgoing interface associated with that route goes into the down state?", ["The static route is removed from the routing table."]], ["Refer to the exhibit. Which is the best way for PC A and PC B to successfully communicate with sites on the Internet?", ["Configure a default route from R1 to ISP and a static route from ISP to R1."]], ["Refer to the exhibit. The small company shown uses static routing. Users on the R2 LAN have reported a problem with connectivity. What is the issue?", ["R1 needs a static route to the R2 LAN."]], ["What happens to a static route entry in a routing table when the outgoing interface is not available?", ["The route is removed from the table."]], ["A company has several networks with the following IP address requirements:", []], ["What would be the best summary route for the following networks?\n10.50.168.0/23\n10.50.170.0/23\n10.50.172.0/23\n10.50.174.0/24", ["10.50.168.0/21"]], ["What is a valid summary route for IPv6 networks 2001:0DB8:ACAD:4::/64, 2001:0DB8:ACAD:5::/64, 2001:0DB8:ACAD:6::/64, and 2001:0DB8:ACAD:7::/64?", ["2001:0DB8:ACAD:0004::/62"]], ["Which three IOS troubleshooting commands can help to isolate problems with a static route? (Choose three.)", ["show ip route", "show ip interface brief", "ping"]], ["Refer to the exhibit. What two commands will change the next-hop address for the 10.0.0.0/8 network from 172.16.40.2 to 192.168.1.2? (Choose two.)", ["A(config)# ip route 10.0.0.0 255.0.0.0 192.168.1.2", "A(config)# no ip route 10.0.0.0 255.0.0.0 172.16.40.2"]], ["Launch PT. Hide and Save PT", []], ["Launch PT. Hide and Save PT", []], ["Consider the following command:\nip route 192.168.10.0 255.255.255.0 10.10.10.2 5\nHow would an administrator test this configuration?", ["Manually shut down the router interface used as a primary route."]]]