[["In which configuration would an outbound ACL placement be preferred over an inbound ACL placement?", ["when the ACL is applied to an outbound interface to filter packets coming from multiple inbound interfaces before the packets exit the interface"]], ["Which address is required in the command syntax of a standard ACL?", ["source IP address"]], ["Which statement describes a difference between the operation of inbound and outbound ACLs?", ["Inbound ACLs are processed before the packets are routed while outbound ACLs are processed after the routing is completed."]], ["Which three statements describe ACL processing of packets? (Choose three.)", ["An implicit deny any rejects any packet that does not match any ACE.", "A packet can either be rejected or forwarded as directed by the ACE that is matched.", "Each statement is checked only until a match is detected or until the end of the ACE list."]], ["What single access list statement matches all of the following networks?\n192.168.16.0\n192.168.17.0\n192.168.18.0\n192.168.19.0", ["access-list 10 permit 192.168.16.0 0.0.3.255"]], ["A network administrator needs to configure a standard ACL so that only the workstation of the administrator with the IP address 192.168.15.23 can access the virtual terminal of the main router. Which two configuration commands can achieve the task? (Choose two.)", ["Router1(config)# access-list 10 permit host 192.168.15.23", "Router1(config)# access-list 10 permit 192.168.15.23 0.0.0.0"]], ["If a router has two interfaces and is routing both IPv4 and IPv6 traffic, how many ACLs could be created and applied to it?", ["8"]], ["Which three statements are generally considered to be best practices in the placement of ACLs? (Choose three.)", ["Filter unwanted traffic before it travels onto a low-bandwidth link.", "Place extended ACLs close to the source IP address of the traffic.", "Place standard ACLs close to the destination IP address of the traffic."]], ["Refer to the exhibit. Which command would be used in a standard ACL to allow only devices on the network attached to R2 G0/0 interface to access the networks attached to R1?", ["access-list 1 permit 192.168.10.96 0.0.0.31"]], ["Refer to the exhibit. If the network administrator created a standard ACL that allows only devices that connect to the R2 G0/0 network access to the devices on the R1 G0/1 interface, how should the ACL be applied?", ["outbound on the R1 G0/1 interface"]], ["Refer to the following output. What is the significance of the 4 match(es) statement?", []], ["On which router should the show access-lists command be executed?", ["on the router that has the ACL configured"]], ["What is the quickest way to remove a single ACE from a named ACL?", ["Use the no keyword and the sequence number of the ACE to be removed."]], ["Which feature will require the use of a named standard ACL rather than a numbered standard ACL?", ["the ability to add additional ACEs in the middle of the ACL without deleting and re-creating the list"]], ["An administrator has configured an access list on R1 to allow SSH administrative access from host 172.16.1.100. Which command correctly applies the ACL?", ["R1(config-line)# access-class 1 in"]], ["Which type of router connection can be secured by the access-class command?", ["vty"]], ["Consider the following output for an ACL that has been applied to a router via the access-class in command. What can a network administrator determine from the output that is shown?", ["Two devices were able to use SSH or Telnet to gain access to the router."]], ["Refer to the exhibit. A router has an existing ACL that permits all traffic from the 172.16.0.0 network. The administrator attempts to add a new ACE to the ACL that denies packets from host 172.16.0.1 and receives the error message that is shown in the exhibit. What action can the administrator take to block packets from host 172.16.0.1 while still permitting all other traffic from the 172.16.0.0 network?", ["Manually add the new deny ACE with a sequence number of 5."]], ["A network administrator issues the show vlan brief command while troubleshooting a user support ticket. What output will be displayed?", ["the VLAN assignment and membership for all switch ports"]], ["Refer to the exhibit. An ACL was configured on R1 with the intention of denying traffic from subnet 172.16.4.0/24 into subnet 172.16.3.0/24. All other traffic into subnet 172.16.3.0/24 should be permitted. This standard ACL was then applied outbound on interface Fa0/0. Which conclusion can be drawn from this configuration?​", ["All traffic will be blocked, not just traffic from the 172.16.4.0/24 subnet."]], ["Refer to the exhibit. What will happen to the access list 10 ACEs if the router is rebooted before any other commands are implemented?", ["The ACEs of access list 10 will be renumbered."]], ["What is the effect of configuring an ACL with only ACEs that deny traffic?", ["The ACL will block all traffic."]], ["Which type of ACL statements are commonly reordered by the Cisco IOS as the first ACEs?", ["host"]], ["A network administrator is configuring an ACL to restrict access to certain servers in the data center. The intent is to apply the ACL to the interface connected to the data center LAN. What happens if the ACL is incorrectly applied to an interface in the inbound direction instead of the outbound direction?", ["The ACL does not perform as designed."]], ["When would a network administrator use the clear access-list counters command?", ["when troubleshooting an ACL and needing to know how many packets matched"]], ["Match each statement with the example subnet and wildcard that it describes. (Not all options are used.)", []], ["What two tasks do dynamic routing protocols perform? (Choose two.)", ["update and maintain routing tables", "network discovery"]], ["What is a disadvantage of using dynamic routing protocols?", ["They send messages about network status insecurely across networks by default."]], ["Which two statements are true regarding classless routing protocols? (Choose two.)", ["sends subnet mask information in routing updates", "allows for use of both 192.168.1.0/30 and 192.168.1.16/28 subnets in the same topology"]], ["An OSPF enabled router is processing learned routes to select best paths to reach a destination network. What is the OSPF algorithm evaluating as the metric?", ["The cumulative bandwidth that is used along the routing path."]], ["After a network topology change occurs, which distance vector routing protocol can send an update message directly to a single neighboring router without unnecessarily notifying other routers?", ["EIGRP"]], ["What is the purpose of the passive-interface command?", ["allows a router to receive routing updates on an interface but not send updates via that interface"]], ["Refer to the exhibit. Based on the partial output from the show ip route command, what two facts can be determined about the RIP routing protocol? (Choose two.)", ["RIP version 2 is running on this router and its RIP neighbor.", "The command no auto-summary has been used on the RIP neighbor router."]], ["While configuring RIPv2 on an enterprise network, an engineer enters the command network 192.168.10.0 into router configuration mode.", ["The interface of the 192.168.10.0 network is sending only version 2 updates."]], ["Refer to the exhibit. A network administrator has issued the exhibited commands in an attempt to activate RIPng on interface gig0/0. What is causing the console message that is shown after RIP is enabled?", ["IPv6 unicast routing has not been enabled on this router."]], ["Refer to the exhibit. OSPF is used in the network. Which path will be chosen by OSPF to send data packets from Net A to Net B?", ["R1, R3, R5, R7"]], ["Which two events will trigger the sending of a link-state packet by a link-state routing protocol? (Choose two.)", ["a change in the topology", "the initial startup of the routing protocol process"]], ["Which two requirements are necessary before a router configured with a link-state routing protocol can build and send its link-state packets? (Choose two.)", ["The router has determined the costs associated with its active links.", "The router has established its adjacencies."]], ["When does a link-state router send LSPs to its neighbors?", ["immediately after receiving an LSP from neighbors with updates"]], ["Which routing protocol uses link-state information to build a map of the topology for computing the best path to each destination network?", ["OSPF"]], ["A destination route in the routing table is indicated with a code D. Which kind of route entry is this?", ["a route dynamically learned through the EIGRP routing protocol"]], ["Refer to the exhibit. Which interface will be the exit interface to forward a data packet with the destination IP address 172.16.0.66?", ["Serial0/0/1"]], ["Which two requirements are used to determine if a route can be considered as an ultimate route in a router’s routing table? (Choose two.)", ["contain an exit interface", "contain a next-hop IP address"]], ["Which route is the best match for a packet entering a router with a destination address of 10.16.0.2?", ["S 10.16.0.0/24 [1/0] via 192.168.0.9"]], ["Which type of route will require a router to perform a recursive lookup?", ["an ultimate route that is using a next hop IP address on a router that is not using CEF"]], ["A router is configured to participate in multiple routing protocol: RIP, EIGRP, and OSPF. The router must send a packet to network 192.168.14.0. Which route will be used to forward the traffic?", ["a 192.168.14.0 /26 route that is learned via RIP"]], ["Fill in the blank. Do not abbreviate.", []], ["Match the features of link-state routing protocols to their advantages and disadvantages. (Not all options are used.)", []], ["Match the characteristic to the corresponding type of routing. (Not all options are used.)", []], ["Which two statements describe the OSPF routing protocol? (Choose two.)", ["calculates its metric using bandwidth", "uses Dijkstra’s algorithm to build the SPF tree"]], ["What two actions result from entering the network 192.168.1.0 command in RIP configuration mode on a router? (Choose two", ["The network address 192.168.1.0 is advertised to the neighbor routers.", "Routing updates are sent through all the interfaces belonging to 192.168.1.0."]], ["Which dynamic routing protocol was developed as an exterior gateway protocol to interconnect different Internet provider", ["BGP"]], ["In the context of routing protocols, what is a definition for time to convergence?", ["the amount of time for the routing tables to achieve a consistent state after a topology change"]], ["A destination route in the routing table is indicated witha code D. Which kind of route entry is this?", ["a route dynamically learned through the EIGRP routing protocol"]], ["Match the router protocol to the corresponding category. (Not all options are used.)", []], ["Which route is the best match for a packet entering a router with a destination address of 10.16.0.2?", ["S 10.16.0.0/24 [1/0] via 192.168.0.9"]], ["What is different between IPv6 routing table entries compared to IPv4 routing table entries?", ["By design IPv6 is classless so all routes are effectively level 1 ultimate routes."]], ["Which route will a router use to forward an IPv4 packet after examining its routing table for the best match with the destination address?", ["a level 1 ultimate route"]]]