[["Which DHCPv4 message will a client send to accept an IPv4 address that is offered by a DHCP server?", ["broadcast DHCPREQUEST"]], ["A company uses DHCP servers to dynamically assign IPv4 addresses to employee workstations. The address lease duration is set as 5 days. An employee returns to the office after an absence of one week. When the employee boots the workstation, it sends a message to obtain an IP address. Which Layer 2 and Layer 3 destination addresses will the message contain?", ["FF-FF-FF-FF-FF-FF and 255.255.255.255"]], ["Which is a DHCPv4 address allocation method that assigns IPv4 addresses for a limited lease period?", ["dynamic allocation"]], ["Which address does a DHCPv4 server target when sending a DHCPOFFER message to a client that makes an address request?", ["client hardware address"]], ["As a DHCPv4 client lease is about to expire, what is the message that the client sends the DHCP server?", ["DHCPREQUEST"]], ["What is an advantage of configuring a Cisco router as a relay agent?", ["It can provide relay services for multiple UDP services."]], ["An administrator issues the commands:\nRouter(config)# interface g0/1\nRouter(config-if)# ip address dhcp\nWhat is the administrator trying to achieve?", ["configuring the router to obtain IP parameters from a DHCPv4 server"]], ["Under which two circumstances would a router usually be configured as a DHCPv4 client? (Choose two.)", ["The router is intended to be used as a SOHO gateway.", "This is an ISP requirement."]], ["A company uses the SLAAC method to configure IPv6 addresses for the employee workstations. Which address will a client use as its default gateway?​", ["the link-local address of the router interface that is attached to the network"]], ["A network administrator configures a router to send RA messages with M flag as 0 and O flag as 1. Which statement describes the effect of this configuration when a PC tries to configure its IPv6 address?", ["It should use the information that is contained in the RA message and contact a DHCPv6 server for additional information"]], ["A company implements the stateless DHCPv6 method for configuring IPv6 addresses on employee workstations. After a workstation receives messages from multiple DHCPv6 servers to indicate their availability for DHCPv6 service, which message does it send to a server for configuration information?", ["DHCPv6 INFORMATION-REQUEST"]], ["An administrator wants to configure hosts to automatically assign IPv6 addresses to themselves by the use of Router Advertisement messages, but also to obtain the DNS server address from a DHCPv6 server. Which address assignment method should be configured?", ["stateless DHCPv6 "]], ["How does an IPv6 client ensure that it has a unique address after it configures its IPv6 address using the SLAAC allocation method?", ["It sends an ICMPv6 Neighbor Solicitation message with the IPv6 address as the target IPv6 address."]], ["What is used in the EUI-64 process to create an IPv6 interface ID on an IPv6 enabled interface?", ["the MAC address of the IPv6 enabled interface"]], ["What two methods can be used to generate an interface ID by an IPv6 host that is using SLAAC? (Choose two.)", ["EUI-64", "random generation"]], ["Refer to the exhibit. Based on the output that is shown, what kind of IPv6 addressing is being configured?", ["stateless DHCPv6"]], ["What is the result of a network technician issuing the command ip dhcp excluded-address 10.0.15.1 10.0.15.15 on a Cisco router?", ["The Cisco router will exclude 15 IP addresses from being leased to DHCP clients."]], ["Refer to the exhibit. What should be done to allow PC-A to receive an IPv6 address from the DHCPv6 server?", ["Add the ipv6 dhcp relay command to interface Fa0/0."]], ["Refer to the exhibit. A network administrator is implementing stateful DHCPv6 operation for the company. However, the clients are not using the prefix and prefix-length information that is configured in the DHCP pool. The administrator issues a show ipv6 interface command. What could be the cause of the problem?", ["The router is configured for stateless DHCPv6 operation"]], ["Refer to the exhibit. A network administrator is implementing the stateless DHCPv6 operation for the company. Clients are configuring IPv6 addresses as expected. However, the clients are not getting the DNS server address and the domain name information configured in the DHCP pool. What could be the cause of the problem?", ["The router is configured for SLAAC operation"]], ["Fill in the blank. Do not abbreviate\nType a command to exclude the first fifteen useable IP addresses from a DHCPv4 address pool of the network 10.0.15.0/24.\nRouter(config)# ip dhcp", ["excluded-address 10.0.15.1 10.0.15.15"]], ["Order the steps of configuring a router as a DHCPv4 Server. (Not all options are used.)", []], ["Match the descriptions to the corresponding DHCPv6 server type. (Not all options are used.)", []], ["A router is participating in an OSPFv2 domain. What will always happen if the dead interval expires before the router receives a hello packet from an adjacent DROTHER OSPF router?", ["OSPF will remove that neighbor from the router link-state database."]], ["Which three statements describe the similarities between OSPFv2 and OSPFv3? (Choose three.)", ["They both are link-state protocols.", "They both share the concept of multiple areas.", "They both use the same DR/BDR election process."]], ["Which OSPF component is identical in all routers in an OSPF area after convergence?", ["link-state database"]], ["Which three statements describe features of the OSPF topology table? (Choose three.)", ["It is a link-state database that represents the network topology.", "When converged, all routers in an area have identical topology tables.", "The table can be viewed via the show ip ospf database command."]], ["What is used to create the OSPF neighbor table?", ["adjacency database"]], ["What is a function of OSPF hello packets?", ["to discover neighbors and build adjacencies between them"]], ["Which OPSF packet contains the different types of link-state advertisements?", ["LSU"]], ["What are the two purposes of an OSPF router ID? (Choose two.)", ["to uniquely identify the router within the OSPF domain", "to facilitate router participation in the election of the designated router"]], ["What is the first criterion used by OPSF routers to elect a DR?", ["highest priority"]], ["Which wildcard mask would be used to advertise the 192.168.5.96/27 network as part of an OSPF configuration?", ["0.0.0.31"]], ["What are two reasons that will prevent two routers from forming an OSPFv2 adjacency? (Choose two.)", ["mismatched OSPF Hello or Dead timers", "mismatched subnet masks on the link interfaces"]], ["Refer to the exhibit. A network administrator issued the command show ip ospf interface on the router R2. What conclusion can be drawn?", ["R2 has not formed an adjacency with any other router."]], ["What command would be used to determine if a routing protocol-initiated relationship had been made with an adjacent router?", ["show ip ospf neighbor"]], ["Which OSPFv3 function works differently from OSPFv2?", ["authentication"]], ["Which three addresses could be used as the destination address for OSPFv3 messages? (Choose three.)", ["FE80::1", "FF02::5", "FF02::6"]], ["What does a Cisco router use automatically to create link-local addresses on serial interfaces when OSPFv3 is implemented?", ["an Ethernet interface MAC address available on the router, the FE80::/10 prefix, and the EUI-64 process"]], ["A network administrator enters the command ipv6 router ospf 64in global configuration mode. What is the result of this command?", ["The OSPFv3 process will be assigned an ID of 64."]], ["Single area OSPFv3 has been enabled on a router via the ipv6 router ospf 20 command. Which command will enable this OSPFv3 process on an interface of that router?", ["ipv6 ospf 20 area 0"]], ["Which command will verify that a router that is running OSPFv3 has formed an adjacency with other routers in its OSPF area?", ["show ipv6 ospf neighbor"]], ["Fill in the blank. Do not use abbreviations.", []], ["Fill in the blank.", []], ["Fill in the blank.", []], ["Match the information to the command that is used to obtain the information. (Not all options are used.)", []], ["Open the PT Activity. Perform the tasks in the activity instructions and then complete the task. What message is displayed on www.ciscoville.com?", ["Completion!"]], ["Which criterion is preferred by the router to choose a router ID?", ["the router-id rid command"]], ["Which command should be used to check the OSPF process ID, the router ID, networks the router is advertising, the neighbors the router is receiving updates from, and the default administrative distance?", ["show ip protocols"]], ["A network administrator enters the command ipv6 router ospf 64 in global configuration mode. What is the result of this command?", ["The OSPFv3 process will be assigned an ID of 64."]], ["When a network engineer is configuring OSPFv3 on a router, which command would the engineer issue immediately before configuring the router ID?", ["ipv6 router ospf 10"]], ["Which command will provide information specific to OSPFv3 routes in the routing table?", ["show ipv6 route ospf"]], ["Fill in the blank.", []], ["Launch PT – Hide and Save PT. Open the PT Activity. Perform the tasks in the activity instructions and then complete the task. What message is displayed on www.ciscoville.com?", ["Completion!"]], ["By order of precedence, match the selection of router ID for an OSFP-enabled router to the possible router ID options. (Not all options are used.)", []], ["Match the description to the term. (Not all options are used.)", []], ["What is the first criterion used by OSPF routers to elect a DR?", ["Highest priority"]], ["What are two reasons that will prevent routers from forming an OSPFv2 adjacency? (Choose two.)", ["mismatched subnet masks on the link interfaces", "mismatched OSPF Hello or Dead timers"]], ["What command would be issued to determine if a routing protocol-initiated relationship has been made with an adjacent router?", ["show ip ospf neighbor"]], ["Match the OSPF state with the order in which it occurs. (Not all options are used.)", []]]