[["What is the primary purpose of NAT?", ["conserve IPv4 addresses"]], ["Which method is used by a PAT-enabled router to send incoming packets to the correct inside hosts?​", ["It uses the destination TCP or UDP port number on the incoming packet."]], ["What are two benefits of NAT? (Choose two.)", ["It saves public IP addresses.", "It adds a degree of privacy and security to a network."]], ["What is a disadvantage of NAT?", ["There is no end-to-end addressing."]], ["What is an advantage of deploying IPv4 NAT technology for internal hosts in an organization?", ["provides flexibility in designing the IPv4 addressing scheme"]], ["Refer to the exhibit. Which address or addresses represent the inside global address?", ["209.165.20.25"]], ["Refer to the exhibit. A technician is configuring R2 for static NAT to allow the client to access the web server. What is a possible reason that the client PC cannot access the web server?", ["Interface S0/0/0 should be identified as the outside NAT interface."]], ["A network administrator configures the border router with the command R1(config)# ip nat inside source list 4 pool corp. What is required to be configured in order for this particular command to be functional?", ["a NAT pool named corp that defines the starting and ending public IP addresses"]], ["When dynamic NAT without overloading is being used, what happens if seven users attempt to access a public server on the Internet when only six addresses are available in the NAT pool?", ["The request to the server for the seventh user fails."]], ["What is defined by the ip nat pool command when configuring dynamic NAT?", ["the pool of global address"]], ["Refer to the exhibit. What is the purpose of the command marked with an arrow shown in the partial configuration output of a Cisco broadband router?", ["defines which addresses can be translated"]], ["A network engineer has configured a router with the command ip nat inside source list 4 pool corp overload. Why did the engineer use the overload option?", ["The company has more private IP addresses than available public IP addresses."]], ["What are two of the required steps to configure PAT? (Choose two.)", ["Define a pool of global addresses to be used for overload translation.", "Identify the inside interface."]], ["What is the major benefit of using NAT with Port Address Translation?", ["It allows many internal hosts to share the same public IPv4 address."]], ["What is the purpose of port forwarding?", ["Port forwarding allows an external user to reach a service on a private IPv4 address that is located inside a LAN."]], ["A network administrator is configuring a static NAT on the border router for a web server located in the DMZ network. The web server is configured to listen on TCP port 8080. The web server is paired with the internal IP address of 192.168.5.25 and the external IP address of 209.165.200.230. For easy access by hosts on the Internet, external users do not need to specify the port when visiting the web server. Which command will configure the static NAT?", ["R1(config)# ip nat inside source static tcp 192.168.5.25 8080 209.165.200.230 80"]], ["What is a characteristic of unique local addresses?", ["They allow sites to be combined without creating any address conflicts."]], ["Which statement describes IPv6 ULAs?", ["They are not routable across the Internet."]], ["Refer to the exhibit. Based on the output that is shown, what type of NAT has been implemented?", ["PAT using an external interface"]], ["Match the steps with the actions that are involved when an internal host with IP address 192.168.10.10 attempts to send a packet to an external server at the IP address 209.165.200.254 across a router R1 that is running dynamic NAT. (Not all options are used.)", []], ["Fill in the blank. Do not use abbreviations.", []], ["A technician is required to configure an edge router to use a different TCP port number for each session with a server on the Internet. What type of Network Address Translation (NAT) should be implemented?", ["a many-to-one address mapping between local and global addresses"]], ["Which three statements describe ACL processing of packets? (Choose three.)", ["An implicit deny any rejects any packet that does not match any ACE.", "A packet can either be rejected or forwarded as directed by the ACE that is matched.", "Each statement is checked only until a match is detected or until the end of the ACE list."]], ["What two functions describe uses of an access control list? (Choose two.)", ["ACLs provide a basic level of security for network access.", "ACLs can control which areas a host can access on a network."]], ["In which configuration would an outbound ACL placement be preferred over an inbound ACL placement?", ["when the ACL is applied to an outbound interface to filter packets coming from multiple inbound interfaces before the packets exit the interface"]], ["Which two characteristics are shared by both standard and extended ACLs? (Choose two.)", ["Both include an implicit deny as a final entry.", "Both can be created by using either a descriptive name or number."]], ["A network administrator needs to configure a standard ACL so that only the workstation of the administrator with the IP address 192.168.15.23 can access the virtual terminal of the main router. Which two configuration commands can achieve the task? (Choose two.)", ["Router1(config)# access-list 10 permit host 192.168.15.23", "Router1(config)# access-list 10 permit 192.168.15.23 0.0.0.0"]], ["What single access list statement matches all of the following networks?\n192.168.16.0\n192.168.17.0\n192.168.18.0\n192.168.19.0", ["access-list 10 permit 192.168.16.0 0.0.3.255"]], ["If a router has two interfaces and is routing both IPv4 and IPv6 traffic, how many ACLs could be created and applied to it?", ["8"]], ["Which three statements are generally considered to be best practices in the placement of ACLs? (Choose three.)", ["Filter unwanted traffic before it travels onto a low-bandwidth link.", "Place extended ACLs close to the source IP address of the traffic.", "Place standard ACLs close to the destination IP address of the traffic."]], ["Refer to the exhibit. A router has an existing ACL that permits all traffic from the 172.16.0.0 network. The administrator attempts to add a new ACE to the ACL that denies packets from host 172.16.0.1 and receives the error message that is shown in the exhibit. What action can the administrator take to block packets from host 172.16.0.1 while still permitting all other traffic from the 172.16.0.0 network?", ["Manually add the new deny ACE with a sequence number of 5."]], ["Refer to the exhibit. What will happen to the access list 10 ACEs if the router is rebooted before any other commands are implemented?", ["The ACEs of access list 10 will be renumbered."]], ["An administrator has configured an access list on R1 to allow SSH administrative access from host 172.16.1.100. Which command correctly applies the ACL?", ["R1(config-line)# access-class 1 in"]], ["Consider the following access list that allows IP phone configuration file transfers from a particular host to a TFTP server:", []], ["Refer to the exhibit. What is the result of adding the established argument to the end of the ACE?", ["Any TCP traffic is allowed to reach the 192.168.254.0 255.255.254.0 network if it is in response to an originated request."]], ["What packets would match the access control list statement that is shown below? access-list 110 permit tcp 172.16.0.0 0.0.0.255 any eq 22", ["SSH traffic from the 172.16.0.0 network to any destination network"]], ["Which statement describes a difference between the operation of inbound and outbound ACLs?", ["Inbound ACLs are processed before the packets are routed while outbound ACLs are processed after the routing is completed."]], ["What is a limitation when utilizing both IPv4 and IPv6 ACLs on a router?", ["Both IPv4 and IPv6 ACLs can be configured on a single device, but cannot share the same name."]], ["What method is used to apply an IPv6 ACL to a router interface?", ["the use of the ipv6 traffic-filter command"]], ["Which IPv6 ACL command entry will permit traffic from any host to an SMTP server on network 2001:DB8:10:10::/64?", ["permit tcp any host 2001:DB8:10:10::100 eq 25"]], ["Refer to the exhibit. The IPv6 access list LIMITED_ACCESS is applied on the S0/0/0 interface of R1 in the inbound direction. Which IPv6 packets from the ISP will be dropped by the ACL on R1?", ["ICMPv6 packets that are destined to PC1"]], ["Which feature is unique to IPv6 ACLs when compared to those of IPv4 ACLs?", ["an implicit permit of neighbor discovery packets"]], ["Which three implicit access control entries are automatically added to the end of an IPv6 ACL? (Choose three.)", ["deny ipv6 any any", "permit icmp any any nd-ns", "permit icmp any any nd-na"]], ["What is the only type of ACL available for IPv6?", ["named extended"]], ["Match each statement with the example subnet and wildcard that it describes. (Not all options are used.)", []], ["Which statement describes a characteristic of standard IPv4 ACLs?", ["They filter traffic based on source IP addresses only."]], ["Which IPv4 address range covers all IP addresses that match the ACL filter specified by 172.16.2.0 with wildcard mask 0.0.1.255?", ["172.16.2.0 to 172.16.3.255"]], ["Refer to the exhibit. The network administrator that has the IP address of 10.0.70.23/25 needs to have access to the corporate FTP server (10.0.54.5/28). The FTP server is also a web server that is accessible to all internal employees on networks within the 10.x.x.x address. No other traffic should be allowed to this server. Which extended ACL would be used to filter this traffic, and how would this ACL be applied? (Choose two.)", []], ["Launch PT – Hide and Save PT", []], ["What are two possible uses of access control lists in an enterprise network? (Choose two.)", ["limiting debug outputs", "controlling virtual terminal access to routers"]]]